; extend function
[Cmds]
klist=alert(getKeysFileList())			;xfold快捷键配置文件列表
slist=alert(getSettingsFileList())		;xfold命令行配置文件列表
sokeys=alert(getSwitchOnKeysTips())		;所有SwitchOn+配置
sokey=alert(getSwitchOnKeysTips({%p}))	;SwitchOn+配置-搜索
so-off=unbindAllSwitchOnKeys;sokeys		;SwitchOn+配置-全部禁用
so-on=bindAllSwitchOnKeys;sokeys		;SwitchOn+配置-全部启用

keymap=keyQueryCsvEx {%p},*,!,!;delayif(2000,exe:QuickLook.exe,mclick,68,18)		;xfold快捷键搜索(**/*/!)-CSV-lbtn-count
keymap2=keyQueryCsvEx **,**,**,{%p},**;delayif(2000,exe:QuickLook.exe,mclick,68,18)	;xfold快捷键搜索(**/*/!)-CSV-scope
keymap3=keyQueryCsvEx **,**,**,**,{%p};delayif(2000,exe:QuickLook.exe,mclick,68,18)	;xfold快捷键搜索(**/*/!)-CSV-switchon

ks=find path:%xfold% {%p};send({enter},600)						;xfold目录文件搜索-关键词
keys=find ext:txt path:%xfold% keys {%p};send({enter},600)		;快捷键配置文件搜索-关键词
sets=find ext:ini path:%xfold% xfold {%p};send({enter},600)		;命令行配置文件搜索-关键词

keysq=keyQueryCsv(**)	;xfold快捷键帮助-QuickLook即时生成
cmdsq=cmdQueryCsv(**)	;xfold命令行帮助-QuickLook即时生成

mkhelper=delay(2000,run,helper);info(building helper...);dumpConflictHotkeyHelper();dumpHotkeyHelper();dumpCmdsHelper();dumpCmds4Capslockplus()	;编译生成xfold帮助
helper=find path:%xfold% ext:csv;send({enter},600)	;xfold主要帮助文件

[Cmds-alias]
activate=safeActivate		;打开应用-若已打开则激活窗口

bfn=fnBackslash_toggleOnOff	;反斜杠作为LButton-切换开关
sfn=spaceFn_toggleOnOff		;空格作为LButton-切换开关 (已知问题 输入法输入有影响)
so=toggleSwitchOn			;SwitchOn-切换开关

lbtn=toggleVLBtnEnabled		;LButton-切换开关
lbtn-on=enableVLBtn			;LButton-开
lbtn-off=disableVLBtn		;LButton-关

bind=bindHotKey				;快捷键绑定
unbind=unbindKey			;快捷键取消绑定

ctab=activateChromeTab		;激活Chrome页签
chrometab=activateChromeTab	;激活Chrome页签

ncmd=addCmd					;新增命令
tcmd=proxyCmd				;新增命令别名
		
fix=fixOnTaskbar			;固定到任务栏

k=keyQuery					;快捷键搜索-按键
kk=keyCmdlineQuery			;快捷键搜索-命令行内容
l=cmdQuery					;命令行搜索-命令
ll=cmdlineQuery				;命令行搜索-命令行内容
kcsv=keyQueryCsv			;快捷键搜索-CSV-按键
kcsvx=keyQueryCsvEx			;xfold快捷键搜索(**/*/!)-CSV-lbtn-count-key-scope-switchon
kkcsv=keyCmdlineQueryCsv	;快捷键搜索-CSV-命令行内容
lcsv=cmdQueryCsv 			;命令行搜索-CSV-命令
llcsv=cmdlineQueryCsv		;命令行搜索-CSV-命令行内容

hotkeys=keysq				;xfold快捷键帮助-QuickLook即时生成
km=keymap					;xfold快捷键搜索(**/*/!)-CSV-lbtn-count
km2=keymap2					;xfold快捷键搜索(**/*/!)-CSV-scope
km3=keymap3					;xfold快捷键搜索(**/*/!)-CSV-switchon

; conflict=dumpConflictHotkeyHelper
